#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
module.database.random_password.db_password: Refreshing state... [id=none]
module.waf.aws_cloudwatch_log_group.waf[0]: Refreshing state... [id=aws-waf-logs-wikivoice-prod]
module.monitoring.aws_cloudwatch_dashboard.main[0]: Refreshing state... [id=wikivoice-prod-dashboard]
module.ecr.aws_ecr_repository.backend: Refreshing state... [id=wikivoice-prod-backend]
module.cicd.data.aws_iam_openid_connect_provider.github: Reading...
module.security.aws_iam_role.ecs_task_execution: Refreshing state... [id=wikivoice-prod-ecs-exec-20260131063952497100000004]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0cc96c8cff0e6eb55]
module.security.aws_iam_role.ecs_task: Refreshing state... [id=wikivoice-prod-ecs-task-20260131063952497100000005]
module.database.aws_db_parameter_group.main: Refreshing state... [id=wikivoice-prod-20260131063952495900000001]
module.database.aws_secretsmanager_secret.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:941614911267:secret:wikivoice-prod-db-credentials-20260131063952497100000002-ORPFWg]
module.cicd.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::941614911267:oidc-provider/token.actions.githubusercontent.com]
module.cicd.aws_iam_role.github_actions_plan: Refreshing state... [id=wikivoice-prod-gh-plan-20260131063952497700000007]
module.cicd.aws_iam_role.github_actions_backend_deploy[0]: Refreshing state... [id=wikivoice-prod-gh-backend-20260131063952650200000008]
module.waf.aws_wafv2_web_acl.api: Refreshing state... [id=c3dcb592-26a3-44f0-964d-98f7e1c40576]
module.cicd.aws_iam_role.github_actions_frontend_deploy[0]: Refreshing state... [id=wikivoice-prod-gh-frontend-20260131070840042500000001]
module.cicd.aws_iam_role.github_actions_apply: Refreshing state... [id=wikivoice-prod-gh-apply-20260131063952497100000006]
module.security.aws_iam_role_policy.ecs_task_execution_secrets: Refreshing state... [id=wikivoice-prod-ecs-exec-20260131063952497100000004:wikivoice-prod-secrets-2026013106395325730000000a]
module.security.aws_iam_role_policy_attachment.ecs_task_execution: Refreshing state... [id=wikivoice-prod-ecs-exec-20260131063952497100000004-2026013106395340850000000d]
module.security.aws_iam_role_policy.ecs_task: Refreshing state... [id=wikivoice-prod-ecs-task-20260131063952497100000005:wikivoice-prod-task-2026013106395330280000000c]
module.ecr.aws_ecr_lifecycle_policy.backend: Refreshing state... [id=wikivoice-prod-backend]
module.cicd.aws_iam_role_policy.github_actions_plan: Refreshing state... [id=wikivoice-prod-gh-plan-20260131063952497700000007:wikivoice-prod-plan-20260131063953256700000009]
module.cicd.aws_iam_role_policy.github_actions_backend_deploy[0]: Refreshing state... [id=wikivoice-prod-gh-backend-20260131063952650200000008:wikivoice-prod-backend-deploy-2026013106395352420000000e]
module.cicd.aws_iam_role_policy.github_actions_apply: Refreshing state... [id=wikivoice-prod-gh-apply-20260131063952497100000006:wikivoice-prod-apply-2026013106395327330000000b]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0355ebee2c8bda5b2]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-0a5884cf59b00c11d]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-0ebe5d99e8f0d365d]
module.security.aws_security_group.ecs_tasks: Refreshing state... [id=sg-00dc17cd298d21836]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-06a498583cdf1eac2]
module.security.aws_security_group.rds: Refreshing state... [id=sg-09d32053ef22d1c60]
module.security.aws_security_group.alb: Refreshing state... [id=sg-08a62154e7892e568]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0bb35f7bbb2a6c583]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-0d8fc0b0a1e04cb12]
module.database.aws_db_subnet_group.main: Refreshing state... [id=wikivoice-prod-20260131064007830200000013]
module.security.aws_security_group_rule.rds_egress_all: Refreshing state... [id=sgrule-2632533273]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06fd2d09de351dbec]
module.networking.aws_route_table.private[1]: Refreshing state... [id=rtb-0bf05c6c202df1e78]
module.networking.aws_route_table.private[0]: Refreshing state... [id=rtb-0faade32dbd921e62]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e7fbe2d20f02d564]
module.security.aws_security_group_rule.ecs_egress_http: Refreshing state... [id=sgrule-1741607325]
module.security.aws_security_group_rule.ecs_ingress_from_alb: Refreshing state... [id=sgrule-2790208859]
module.security.aws_security_group_rule.ecs_egress_dns: Refreshing state... [id=sgrule-1786986781]
module.security.aws_security_group_rule.ecs_egress_rds: Refreshing state... [id=sgrule-4248271276]
module.security.aws_security_group_rule.rds_ingress_from_ecs: Refreshing state... [id=sgrule-3023261831]
module.security.aws_security_group_rule.ecs_egress_https: Refreshing state... [id=sgrule-3428706022]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a2215acacc249a98]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03c1df4f3e803c5c7]
module.database.aws_db_instance.main: Refreshing state... [id=db-44SK3PK5XGYPSHADFZO772RPN4]
module.database.aws_secretsmanager_secret_version.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:941614911267:secret:wikivoice-prod-db-credentials-20260131063952497100000002-ORPFWg|terraform-20260131064845751300000017]
module.database.aws_cloudwatch_metric_alarm.database_cpu[0]: Refreshing state... [id=wikivoice-prod-db-cpu-utilization]
module.database.aws_cloudwatch_metric_alarm.database_storage[0]: Refreshing state... [id=wikivoice-prod-db-storage-space]
module.database.aws_cloudwatch_metric_alarm.database_connections[0]: Refreshing state... [id=wikivoice-prod-db-connections]
module.database.aws_cloudwatch_metric_alarm.database_memory[0]: Refreshing state... [id=wikivoice-prod-db-freeable-memory]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-2:941614911267:cluster/wikivoice-prod-cluster]
module.ecs.aws_cloudwatch_log_group.ecs_tasks: Refreshing state... [id=/ecs/wikivoice-prod]
module.ecs.aws_lb_target_group.backend: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:941614911267:targetgroup/wikivo20260131064845998000000018/9e6f3aa5eeab3c09]
module.ecs.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:941614911267:loadbalancer/app/wikivoice-prod-alb/54a49a0d1ddda579]
module.waf.aws_wafv2_web_acl_logging_configuration.waf[0]: Refreshing state... [id=arn:aws:wafv2:us-east-1:941614911267:global/webacl/wikivoice-prod-api-waf/c3dcb592-26a3-44f0-964d-98f7e1c40576]
module.ecs.aws_ecs_task_definition.backend: Refreshing state... [id=wikivoice-prod-backend]
module.monitoring.aws_cloudwatch_metric_alarm.alb_5xx_errors[0]: Refreshing state... [id=wikivoice-prod-alb-5xx-errors]
module.monitoring.aws_cloudwatch_metric_alarm.alb_healthy_hosts[0]: Refreshing state... [id=wikivoice-prod-alb-healthy-hosts]
module.monitoring.aws_cloudwatch_metric_alarm.alb_4xx_errors[0]: Refreshing state... [id=wikivoice-prod-alb-4xx-errors]
module.monitoring.aws_cloudwatch_metric_alarm.alb_response_time[0]: Refreshing state... [id=wikivoice-prod-alb-response-time]
module.ecs.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:941614911267:listener/app/wikivoice-prod-alb/54a49a0d1ddda579/1e9e35e9e58a411b]
module.ecs.aws_ecs_service.backend: Refreshing state... [id=arn:aws:ecs:eu-west-2:941614911267:service/wikivoice-prod-cluster/wikivoice-prod-backend]
module.cloudfront.random_password.origin_verify: Refreshing state... [id=none]
module.cloudfront.aws_cloudfront_origin_request_policy.api_origin: Refreshing state... [id=d323f0d5-337e-4036-ac70-76da73ad0b12]
module.cloudfront.aws_cloudfront_response_headers_policy.security: Refreshing state... [id=65592ea3-2d41-4b13-be43-9d2d6ed2c447]
module.monitoring.aws_appautoscaling_target.ecs_service: Refreshing state... [id=service/wikivoice-prod-cluster/wikivoice-prod-backend]
module.cloudfront.aws_secretsmanager_secret.cloudfront_origin: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:941614911267:secret:wikivoice-prod-cloudfront-origin-20260131065118750300000001-we04UE]
module.cloudfront.aws_cloudfront_function.cache_control: Refreshing state... [id=wikivoice-prod-cache-control]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_cpu_high[0]: Refreshing state... [id=wikivoice-prod-ecs-cpu-high]
module.cloudfront.aws_cloudfront_cache_policy.api_cache: Refreshing state... [id=bd735f5b-cc4c-481e-86dd-53e0118237b8]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_memory_high[0]: Refreshing state... [id=wikivoice-prod-ecs-memory-high]
module.cloudfront.aws_secretsmanager_secret_version.cloudfront_origin: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:941614911267:secret:wikivoice-prod-cloudfront-origin-20260131065118750300000001-we04UE|terraform-20260131065119420500000003]
module.monitoring.aws_appautoscaling_policy.ecs_cpu[0]: Refreshing state... [id=wikivoice-prod-cpu-scaling]
module.monitoring.aws_appautoscaling_policy.ecs_memory[0]: Refreshing state... [id=wikivoice-prod-memory-scaling]
module.cloudfront.aws_cloudfront_distribution.api: Refreshing state... [id=E35K7HZ8G33IIU]
module.frontend.aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=E139RV291FRUAQ]
module.frontend.aws_cloudfront_function.spa_routing: Refreshing state... [id=wikivoice-prod-spa-routing]
module.frontend.aws_cloudfront_cache_policy.frontend: Refreshing state... [id=eee41f5c-670a-43f5-9f9c-a3d4b89bc82e]
module.frontend.aws_cloudfront_response_headers_policy.frontend: Refreshing state... [id=f4e64ffd-b153-43e7-8240-35e4e5b49eaa]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=wikivoice-prod-frontend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.cloudfront.aws_cloudfront_distribution.api will be updated in-place
  ~ resource "aws_cloudfront_distribution" "api" {
        id                              = "E35K7HZ8G33IIU"
        tags                            = {
            "Environment" = "prod"
            "Name"        = "wikivoice-prod-cdn"
            "Project"     = "wikivoice"
        }
        # (23 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ viewer_protocol_policy     = "allow-all" -> "redirect-to-https"
            # (15 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      - origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (2 unchanged blocks hidden)
    }

  # module.cloudfront.aws_cloudfront_function.cache_control will be updated in-place
  ~ resource "aws_cloudfront_function" "cache_control" {
      ~ code                         = <<-EOT
          - function handler(event) {
          + function handler(event) {
          -     var request = event.request;
          +     var request = event.request;
          - 
          + 
          -     // POST/PUT/DELETE/PATCH - NEVER cache, always pass through
          +     // POST/PUT/DELETE/PATCH - NEVER cache, always pass through
          -     // These methods modify data, so caching would be dangerous
          +     // These methods modify data, so caching would be dangerous
          -     if (request.method !== 'GET' && request.method !== 'HEAD') {
          +     if (request.method !== 'GET' && request.method !== 'HEAD') {
          -         return request; // Pass through as-is, backend response won't be cached
          +         return request; // Pass through as-is, backend response won't be cached
          -     }
          +     }
          - 
          + 
          -     // For GET/HEAD requests:
          +     // For GET/HEAD requests:
          -     // - CloudFront will cache based on default_ttl/max_ttl settings
          +     // - CloudFront will cache based on default_ttl/max_ttl settings
          -     // - OR respect Cache-Control header from your backend if present
          +     // - OR respect Cache-Control header from your backend if present
          -     // - Your backend can send "Cache-Control: no-cache" for dynamic data
          +     // - Your backend can send "Cache-Control: no-cache" for dynamic data
          -     // - Your backend can send "Cache-Control: max-age=300" for cacheable data
          +     // - Your backend can send "Cache-Control: max-age=300" for cacheable data
          - 
          + 
          -     return request;
          +     return request;
            }
        EOT
        id                           = "wikivoice-prod-cache-control"
        name                         = "wikivoice-prod-cache-control"
        # (8 unchanged attributes hidden)
    }

  # module.cloudfront.aws_cloudfront_response_headers_policy.security will be updated in-place
  ~ resource "aws_cloudfront_response_headers_policy" "security" {
        id      = "65592ea3-2d41-4b13-be43-9d2d6ed2c447"
        name    = "wikivoice-prod-security-headers"
        # (3 unchanged attributes hidden)

      ~ cors_config {
            # (3 unchanged attributes hidden)

          ~ access_control_allow_origins {
              ~ items = [
                  - "https://d2781vnwilh51c.cloudfront.net",
                    # (1 unchanged element hidden)
                ]
            }

            # (3 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_task_definition.backend must be replaced
-/+ resource "aws_ecs_task_definition" "backend" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:941614911267:task-definition/wikivoice-prod-backend:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-2:941614911267:task-definition/wikivoice-prod-backend" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (1 unchanged element hidden)
                        {
                            name  = "ENVIRONMENT"
                            value = "production"
                        },
                      - {
                          - name  = "FRONTEND_URL"
                          - value = "https://d2781vnwilh51c.cloudfront.net"
                        },
                        {
                            name  = "JSON_LOGS"
                            value = "true"
                        },
                        # (5 unchanged elements hidden)
                    ]
                  - mountPoints      = []
                    name             = "backend"
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8000
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "wikivoice-prod-backend" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "Name"        = "wikivoice-prod-backend-task"
            "Project"     = "wikivoice"
        }
        # (12 unchanged attributes hidden)
    }

  # module.ecs.aws_lb_listener.http will be updated in-place
  ~ resource "aws_lb_listener" "http" {
        id                                                                  = "arn:aws:elasticloadbalancing:eu-west-2:941614911267:listener/app/wikivoice-prod-alb/54a49a0d1ddda579/1e9e35e9e58a411b"
        tags                                                                = {
            "Environment" = "prod"
            "Project"     = "wikivoice"
        }
        # (17 unchanged attributes hidden)

      ~ default_action {
          ~ type             = "forward" -> "redirect"
            # (2 unchanged attributes hidden)

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.ecs.aws_lb_listener.https[0] will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:eu-west-2:941614911267:loadbalancer/app/wikivoice-prod-alb/54a49a0d1ddda579"
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags                                                                  = {
          + "Environment" = "prod"
          + "Project"     = "wikivoice"
        }
      + tags_all                                                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "wikivoice"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-2:941614911267:targetgroup/wikivo20260131064845998000000018/9e6f3aa5eeab3c09"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.frontend.aws_cloudfront_function.spa_routing will be updated in-place
  ~ resource "aws_cloudfront_function" "spa_routing" {
      ~ code                         = <<-EOT
          - function handler(event) {
          + function handler(event) {
          -   var request = event.request;
          +   var request = event.request;
          -   var uri = request.uri;
          +   var uri = request.uri;
          - 
          + 
          -   // Check if the URI has a file extension
          +   // Check if the URI has a file extension
          -   if (uri.includes('.')) {
          +   if (uri.includes('.')) {
          -     return request;
          +     return request;
          -   }
          +   }
          - 
          + 
          -   // Rewrite to index.html for SPA routing
          +   // Rewrite to index.html for SPA routing
          -   request.uri = '/index.html';
          +   request.uri = '/index.html';
          -   return request;
          +   return request;
            }
        EOT
        id                           = "wikivoice-prod-spa-routing"
        name                         = "wikivoice-prod-spa-routing"
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  ~ alb_url                                 = "http://wikivoice-prod-alb-925859937.eu-west-2.elb.amazonaws.com" -> "https://wikivoice-prod-alb-925859937.eu-west-2.elb.amazonaws.com"

```

</details>

*Pusher: @Antony-evm, Action: `pull_request`, Workflow: `Terraform Plan`*